Revit.Elements.Family
A Revit Family

Revit.Elements.Family.InternalSetFamily(Autodesk.Revit.DB.Family)
Set the internal Revit representation and update the ElementId and UniqueId
family:

Revit.Elements.Family.ByName(System.String)
Obtain a Family from the current document given it's name
name: The name of the family in the current document
Returns:

Revit.Elements.Family.FromExisting(Autodesk.Revit.DB.Family,System.Boolean)
Construct an Element from an existing Element in the Document
family:
isRevitOwned:
Returns:

Revit.Elements.Family.InternalElement
Reference to the Element

Revit.Elements.Family.Symbols
Obtain the FamilySymbols from this Family

Revit.Elements.Family.Name
The name of this family